const Mock = require('mockjs');

// Mock响应模板
let data = Mock.mock({
    "hot": [
            {
                "id": "01",
                "img": "http://localhost:3000/uploads/movieLogo-1556973469606.jpg",
                "score": "9.1",
                "peopleEvaluate": "(114.2万人评)",
                "nm": "复仇者联盟4：终局之战",
                "src": "美国/181分钟",
                "type":"动作,冒险,奇幻",
                "pubDesc":"2019-04-24大陆上映",
                "star":"小罗伯特·唐尼,克里斯·埃文斯,马克·鲁法洛",
                "details":"改编自漫威漫画，也是漫威电影宇宙第22部影片。复仇者联盟的一众超级英雄，必须抱着牺牲一切的信念，与史上最强大反派灭霸殊死一搏，阻止其摧毁宇宙的邪恶计划。"
            },
            {
                "id": "02",
                "img": "http://localhost:3000/uploads/movieLogo-1556973511370.jpg",
                "score": "9.4",
                "peopleEvaluate": "(7.7万人评)",
                "nm": "何以为家",
                "src": "黎巴嫩,法国/116分钟",
                "type":"剧情",
                "pubDesc":"2019-04-29大陆上映",
                "star":"赞恩·阿尔·拉菲亚,约丹诺斯·希费罗,博鲁瓦蒂夫·特雷杰·班科尔",
                "details":"法庭上，十二岁的男孩赞恩（赞恩·阿尔·拉菲亚 饰）向法官状告他的亲生父母，原因是，他们给了他生命。是什么样的经历让一个孩子做出如此不可思议的举动？故事中，赞恩的父母在无力抚养和教育的状况下依然不停生育，作为家中的长子赞恩，弱小的肩膀承担了无数生活的重压。当妹妹被强行卖给商贩为妻时，赞恩愤怒离家，之后遇到一对没有合法身份的母子，相互扶持勉强生活。然而生活并没有眷顾赞恩，重重磨难迫使他做出了令人震惊的举动……"
            },
            {
                "id": "03",
                "img": "http://localhost:3000/uploads/movieLogo-1556973577724.jpg",
                "score": "9.0",
                "peopleEvaluate": "(9.7万人评)",
                "nm": "大侦探皮卡丘",
                "src": "美国/104分钟",
                "type":"喜剧,动画,冒险",
                "pubDesc":"2019-05-10大陆上映",
                "star":"瑞安·雷诺兹,贾斯蒂斯·史密斯,凯瑟琳·纽顿",
                "details":"蒂姆·古德曼（贾斯提斯·史密斯 饰） 为寻找下落不明的父亲来到莱姆市，意外与父亲的前宝可梦搭档大侦探皮卡丘相遇，并惊讶地发现自己是唯一能听懂皮卡丘说话的人类，他们决定组队踏上揭开真相的刺激冒险之路。探案过程中他们邂逅了各式各样的宝可梦，并意外发现了一个足以毁灭整个宝可梦宇宙的惊天阴谋。"
            },
            {
                "id": "04",
                "img": "http://localhost:3000/uploads/movieLogo-1556973618598.jpg",
                "score": "4.2",
                "peopleEvaluate": "(11.8万人评)",
                "nm": "下一任：前任",
                "src": "中国大陆/99分钟",
                "type":"爱情",
                "pubDesc":"2019-05-01大陆上映",
                "star":"郭采洁,郑恺,李东学",
                "details":"林心恬（郭采洁 饰）的爱情路一直不顺，总是不能在对的时间遇到对的人。正当她心灰意冷时，缘份使她邂逅了多情暖男吾川（郑恺 饰），吾川对心恬展开狂热追求，最终心恬被打动。然而意料之外的是，心恬自学生时期就暗恋的学霸男神黄克群（李东学 饰）又出现了。是该选择近在眼前的幸福，还是多年前梦寐以求的白马王子？当心恬做出决定后才发现，原来爱情在冥冥中早已注定！"
            },
            {
                "id": "05",
                "img": "http://localhost:3000/uploads/movieLogo-1556973663623.jpg",
                "score": "8.3",
                "peopleEvaluate": "(1.1万人评)",
                "nm": "雪暴",
                "src": "中国大陆/112分钟",
                "type":"剧情,犯罪,动作,悬疑",
                "pubDesc":"2019-04-30大陆上映",
                "star":"张震,廖凡,倪妮",
                "details":"在一座极北的边陲小镇，一伙穷凶极恶、作案手法老到的悍匪为抢夺黄金，打劫运金车，并借助大雪掩盖了所有犯罪痕迹。为了探求真相，警察王康浩（张震 饰）暗地里搜集证据，熟悉地形，终于在一场灾难级的暴雪降临时，与谋财害命的悍匪发生了惊心动魄的正面对决……"
            },
            {
                "id": "06",
                "img": "http://localhost:3000/uploads/movieLogo-1556973707699.jpg",
                "score": "8.7",
                "peopleEvaluate": "(8872万人评)",
                "nm": "神奇乐园历险记",
                "src": "美国,西班牙/85分钟",
                "type":"动画,冒险,喜剧,家庭",
                "pubDesc":"2019-04-19大陆上映",
                "star":"索菲亚·玛丽,詹妮弗·加纳,肯·哈德森·坎贝尔",
                "details":"在一座极北的边陲小镇，一伙穷凶极恶、作案手法老到的悍匪为抢夺黄金，打劫运金车，并借助大雪掩盖了所有犯罪痕迹。为了探求真相，警察王康浩（张震 饰）暗地里搜集证据，熟悉地形，终于在一场灾难级的暴雪降临时，与谋财害命的悍匪发生了惊心动魄的正面对决……"
            },
            {
                "id": "07",
                "img": "http://localhost:3000/uploads/movieLogo-1556973761578.jpg",
                "score": "8.9",
                "peopleEvaluate": "(11.9万人评)",
                "nm": "一个母亲的复仇",
                "src": "印度/146分钟",
                "type":"剧情,犯罪",
                "pubDesc":"2019-05-10大陆上映",
                "star":"希里黛玉,阿克夏耶·坎纳,萨佳·阿里",
                "details":"本片改编自震惊印度的“德里黑公交案”。艾莉亚（萨佳·阿里 饰）在一次派对活动后遭到强暴，面对凿凿证据，四名罪犯却被法庭判为无罪。艾莉亚的继母，戴维琪（希里黛玉 饰）伤心欲绝，在走投无路后愤然决定亲手为女儿寻求正义。一场高能高智商的复仇大戏拉开序幕。正义到不了的地方，还有母亲！"
            }
        ]
})

module.exports = {
    [`GET /mock/hotDetails`](req,res){
        setTimeout(() => {
            res.json({
                status:200,
                data
            })
        }, 200);
    }
}